app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {
        $this->validateLogin($request);

        if ($this->hasTooManyLoginAttempts($request)) {
            $this->fireLockoutEvent($request);
            return $this->sendLockoutResponse($request);
        }

        $connection = Connection::whereRaw('LOWER(Company) = ?', [strtolower(request('company'))])->first();
---
select top 1 * from [connections] where LOWER(Company) = 'hotech'